[
    {
        "id": "japanese_chef_001",
        "chef_picture": "https://images.unsplash.com/photo-1573637798035-53c4aa94d094?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=687&q=80",
        "chef_name": "Tadano Hitohito",
        "years_of_experience": 10,
        "number_of_recipes": 75,
        "likes": 4000,
        "bio": "Tadano Hitohito is a Japanese chef who specializes in traditional Japanese cuisine. He was born and raised in Tokyo and learned how to cook from her grandmother. Yuki is known for her attention to detail and the high quality of her ingredients. He has worked in top restaurants in Japan and has won several awards for her culinary creations. In her free time, Yuki enjoys practicing calligraphy and studying tea ceremony.",
        "recipes": [
            {
                "id": "tempura_001",
                "recipe_name": "Tempura",
                "ingredients": [
                    "shrimp",
                    "flour",
                    "cornstarch",
                    "egg",
                    "ice water",
                    "vegetable oil"
                ],
                "cooking_method": "1. Prepare the shrimp by removing the shells and deveining them.\n2. In a bowl, mix together the flour and cornstarch.\n3. In another bowl, whisk the egg and ice water together.\n4. Heat the vegetable oil in a deep pot or wok.\n5. Dip the shrimp in the flour mixture, then the egg mixture, then the flour mixture again.\n6. Fry the shrimp in the hot oil until golden brown.\n7. Serve hot with dipping sauce.",
                "rating": 4.7
            },
            {
                "id": "ramen_001",
                "recipe_name": "Ramen",
                "ingredients": [
                    "pork belly",
                    "ramen noodles",
                    "eggs",
                    "green onions",
                    "bean sprouts",
                    "seaweed",
                    "chicken broth",
                    "soy sauce",
                    "mirin",
                    "sake"
                ],
                "cooking_method": "1. Preheat the oven to 350°F (175°C).\n2. Season the pork belly with salt and pepper and place it in a baking dish.\n3. Bake the pork belly for 1-2 hours, until it's tender.\n4. Bring a pot of water to a boil and cook the ramen noodles according to the package instructions.\n5. In a separate pot, bring the chicken broth to a boil and add the soy sauce, mirin, and sake.\n6. Slice the green onions and chop the seaweed.\n7. Soft-boil the eggs by cooking them in boiling water for 6-7 minutes, then immediately transferring them to ice water.\n8. Assemble the ramen by placing the cooked noodles in a bowl, then adding the broth, pork belly, green onions, bean sprouts, seaweed, and egg.\n9. Serve hot.",
                "rating": 4.9
            },
            {
                "id": "gyudon_001",
                "recipe_name": "Gyudon",
                "ingredients": [
                    "beef",
                    "onion",
                    "rice",
                    "sake",
                    "mirin",
                    "soy sauce",
                    "sugar",
                    "scallions"
                ],
                "cooking_method": "1. Cook the rice according to the package instructions.\n2. Slice the beef and onion thinly.\n3. In a pan, mix together the sake, mirin, soy sauce, and sugar.\n4. Add the beef and onion to the pan and cook until the beef iscooked through and the onion is translucent.\n5. Serve the beef and onion over the cooked rice.\n6. Garnish with sliced scallions.\n7. Serve hot.",
                "rating": 4.5
            }
        ]
    },
    {
        "id": "japanese_chef_002",
        "chef_picture": "https://images.unsplash.com/photo-1627901594749-3976f7677cb0?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=717&q=80",
        "chef_name": "Kenji Tanaka",
        "years_of_experience": 15,
        "number_of_recipes": 100,
        "likes": 6000,
        "bio": "Kenji Tanaka is a Japanese chef who specializes in modern Japanese cuisine. He trained under several renowned chefs in Japan and has worked in top restaurants in Tokyo and New York. Kenji is known for his innovative approach to traditional Japanese dishes and his use of local and seasonal ingredients. He has won several awards for his culinary creations and has been featured in many food magazines and TV shows.",
        "recipes": [
            {
                "id": "sushi_001",
                "recipe_name": "Sushi",
                "ingredients": [
                    "sushi rice",
                    "rice vinegar",
                    "sugar",
                    "salt",
                    "nori",
                    "fish",
                    "wasabi",
                    "soy sauce",
                    "pickled ginger"
                ],
                "cooking_method": "1. Cook the sushi rice according to the package instructions.\n2. In a small saucepan, heat the rice vinegar, sugar, and salt until the sugar and salt dissolve.\n3. Add the vinegar mixture to the cooked rice and mix well.\n4. Cut the fish into small pieces.\n5. Cut the nori into strips.\n6. Wet your hands and shape the rice into small balls.\n7. Place a piece of fish on top of each rice ball.\n8. Serve with wasabi, soy sauce, and pickled ginger.",
                "rating": 4.8
            },
            {
                "id": "okonomiyaki_001",
                "recipe_name": "Okonomiyaki",
                "ingredients": [
                    "flour",
                    "water",
                    "egg",
                    "cabbage",
                    "pork belly",
                    "green onion",
                    "bonito flakes",
                    "okonomiyaki sauce",
                    "mayonnaise"
                ],
                "cooking_method": "1. In a bowl, mix together the flour, water, and egg to make the batter.\n2. Shred the cabbage and thinly slice the pork belly and green onion.\n3. Add the cabbage, pork belly, and green onion to the batter.\n4. Heat a griddle or large pan over medium-high heat.\n5. Pour the batter onto the griddle to form pancakes.\n6. Cook the pancakes for 3-4 minutes on each side, until golden brown.\n7. Drizzle okonomiyaki sauce and mayonnaise on top of the pancakes.\n8. Sprinkle bonito flakes on top.\n9. Serve hot.",
                "rating": 4.6
            },
            {
                "id": "udon_001",
                "recipe_name": "Udon",
                "ingredients": [
                    "udon noodles",
                    "chicken broth",
                    "soy sauce",
                    "mirin",
                    "sake",
                    "chicken",
                    "green onion",
                    "fish cake"
                ],
                "cooking_method": "1. Bring a pot of water to a boil and cook the udon noodles according to the package instructions.\n2. In a separate pot, bring the chicken broth to a boil and add the soy sauce, mirin, and sake.\n3. Slice the chicken thinly and add it to the broth.\n4. Slice thegreen onion and fish cake into small pieces.\n5. Once the chicken is cooked, add the green onion and fish cake to the broth.\n6. Serve the udon noodles in a bowl and pour the hot broth over them.\n7. Serve hot.",
                "rating": 4.7
            }
        ]
    },
    {
        "id": "japanese_chef_003",
        "chef_picture": "https://images.unsplash.com/photo-1470114755716-3e1124c6c3bd?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1098&q=80",
        "chef_name": "Hiiragi Isshin",
        "years_of_experience": 10,
        "number_of_recipes": 80,
        "likes": 5000,
        "bio": "Hiiragi Isshin is a Japanese chef who specializes in traditional Japanese cuisine. He trained in Kyoto and has worked in top restaurants in Tokyo and Osaka. Yuka is known for her delicate and precise cooking techniques and her attention to detail. He is a master of kaiseki, a multi-course Japanese meal that features seasonal and local ingredients. Yuka has won several awards for her culinary skills and is highly respected in the Japanese culinary community.",
        "recipes": [
            {
                "id": "tempura_001",
                "recipe_name": "Tempura",
                "ingredients": [
                    "shrimp",
                    "flour",
                    "cornstarch",
                    "baking powder",
                    "cold water",
                    "oil",
                    "salt"
                ],
                "cooking_method": "1. Peel and devein the shrimp, leaving the tails on.\n2. In a bowl, mix together the flour, cornstarch, baking powder, and salt.\n3. Add the cold water and mix until the batter is smooth.\n4. Heat the oil in a deep pot or fryer to 375°F.\n5. Dip the shrimp in the batter and gently place them in the hot oil.\n6. Fry the shrimp until they are golden brown and crispy.\n7. Remove the shrimp from the oil and place them on a paper towel to drain.\n8. Serve hot with soy sauce or tempura sauce.",
                "rating": 4.9
            },
            {
                "id": "miso_soup_001",
                "recipe_name": "Miso Soup",
                "ingredients": [
                    "dashi stock",
                    "miso paste",
                    "tofu",
                    "green onion",
                    "seaweed"
                ],
                "cooking_method": "1. In a pot, bring the dashi stock to a simmer.\n2. Add the miso paste to the stock and stir until it is fully dissolved.\n3. Cut the tofu into small cubes and add it to the soup.\n4. Slice the green onion and add it to the soup.\n5. Cut the seaweed into small pieces and add it to the soup.\n6. Simmer the soup for a few minutes until the tofu is cooked.\n7. Serve hot.",
                "rating": 4.5
            },
            {
                "id": "teriyaki_chicken_001",
                "recipe_name": "Teriyaki Chicken",
                "ingredients": [
                    "chicken thighs",
                    "soy sauce",
                    "sugar",
                    "mirin",
                    "sake",
                    "oil",
                    "sesame seeds",
                    "green onion"
                ],
                "cooking_method": "1. In a bowl, mix together the soy sauce, sugar, mirin, and sake to make the teriyaki sauce.\n2. Cut the chicken thighs into bite-sized pieces.\n3. Heat the oil in a pan over medium-high heat.\n4. Add the chicken to the pan and cook until it is browned on all sides.\n5. Pour the teriyaki sauce over the chickenand stir to coat the chicken.\n6. Reduce the heat to low and simmer until the chicken is cooked through and the sauce has thickened.\n7. Garnish with sesame seeds and sliced green onion.\n8. Serve hot with rice or vegetables.",
                "rating": 4.8
            }
        ]
    },
    {
        "id": "japanese_chef_004",
        "chef_picture": "https://images.unsplash.com/photo-1580827929620-e1a34bc162fd?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=735&q=80",
        "chef_name": "Takashi Ono",
        "years_of_experience": 12,
        "number_of_recipes": 75,
        "likes": 4000,
        "bio": "Takashi Ono is a Japanese chef who has worked in top restaurants in Tokyo and Osaka. He is a master of sushi and sashimi and is known for his innovative and creative approach to traditional Japanese cuisine. Takashi is also an expert in sake and has an extensive knowledge of the different types and flavors of sake. He has won several awards for his culinary skills and is highly respected in the Japanese culinary community.",
        "recipes": [
            {
                "id": "sushi_roll_001",
                "recipe_name": "California Roll",
                "ingredients": [
                    "sushi rice",
                    "nori seaweed",
                    "crab meat",
                    "avocado",
                    "cucumber",
                    "mayonnaise",
                    "rice vinegar",
                    "sugar",
                    "salt"
                ],
                "cooking_method": "1. Cook the sushi rice according to the package instructions.\n2. In a bowl, mix together the rice vinegar, sugar, and salt.\n3. Spread the cooked rice on a sheet of nori seaweed.\n4. Flip the nori over so that the rice is facing down.\n5. Spread mayonnaise on the nori.\n6. Add the crab meat, avocado, and cucumber on top of the mayonnaise.\n7. Roll up the sushi tightly and slice into bite-sized pieces.\n8. Serve with soy sauce and wasabi.",
                "rating": 4.7
            },
            {
                "id": "ramen_002",
                "recipe_name": "Shoyu Ramen",
                "ingredients": [
                    "ramen noodles",
                    "chicken broth",
                    "soy sauce",
                    "mirin",
                    "pork belly",
                    "hard-boiled egg",
                    "bamboo shoots",
                    "green onion"
                ],
                "cooking_method": "1. Cook the ramen noodles according to the package instructions.\n2. In a pot, heat the chicken broth and add soy sauce and mirin to taste.\n3. Slice the pork belly into thin strips and fry until crispy.\n4. Slice the hard-boiled egg in half.\n5. Cut the bamboo shoots into thin strips.\n6. Add the cooked ramen noodles to the hot broth.\n7. Garnish with the pork belly, hard-boiled egg, bamboo shoots, and sliced green onion.\n8. Serve hot.",
                "rating": 4.9
            },
            {
                "id": "sashimi_002",
                "recipe_name": "Tuna Sashimi",
                "ingredients": [
                    "tuna",
                    "wasabi",
                    "soy sauce",
                    "pickled ginger"
                ],
                "cooking_method": "1. Slice the tuna into thin slices.\n2. Arrange the tuna slices on a plate.\n3. Serve with wasabi, soy sauce, and pickled ginger.",
                "rating": 4.8
            }
        ]
    },
    {
        "id": "japanese_chef_005",
        "chef_picture": "https://images.unsplash.com/photo-1606921853348-de18ac731b17?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=687&q=80",
        "chef_name": "Toriko Nakamura",
        "years_of_experience": 8,
        "number_of_recipes": 60,
        "likes": 2500,
        "bio": "Toriko Nakamura is a Japanese chef who specializes in traditional Kaiseki cuisine. He has trained in some of the top Kaiseki restaurants in Kyoto and Tokyo, and has a deep understanding of the delicate balance of flavors and textures in Kaiseki dishes. Toriko is also an expert in the use of seasonal ingredients, and incorporates the freshest ingredients into her dishes. He is highly respected in the Japanese culinary community for her dedication to preserving traditional Japanese cuisine.",
        "recipes": [
            {
                "id": "soba_noodles_001",
                "recipe_name": "Cold Soba Noodles",
                "ingredients": [
                    "soba noodles",
                    "soy sauce",
                    "mirin",
                    "sake",
                    "sugar",
                    "scallions",
                    "wasabi"
                ],
                "cooking_method": "1. Cook the soba noodles according to the package instructions.\n2. Rinse the cooked noodles under cold running water.\n3. In a bowl, mix together soy sauce, mirin, sake, and sugar to make a dipping sauce.\n4. Slice scallions thinly.\n5. Serve the soba noodles with the dipping sauce, sliced scallions, and wasabi on the side.",
                "rating": 4.6
            },
            {
                "id": "tempura_002",
                "recipe_name": "Shrimp and Vegetable Tempura",
                "ingredients": [
                    "shrimp",
                    "vegetables (e.g. sweet potato, eggplant, bell pepper)",
                    "tempura batter mix",
                    "vegetable oil"
                ],
                "cooking_method": "1. Peel and devein the shrimp.\n2. Cut the vegetables into bite-sized pieces.\n3. Prepare the tempura batter mix according to the package instructions.\n4. Heat the vegetable oil in a deep pot.\n5. Dip the shrimp and vegetables into the tempura batter.\n6. Fry the shrimp and vegetables in the hot oil until golden brown.\n7. Drain on paper towels.\n8. Serve hot with soy sauce.",
                "rating": 4.9
            },
            {
                "id": "sushi_003",
                "recipe_name": "Nigiri Sushi",
                "ingredients": [
                    "sushi rice",
                    "nori seaweed",
                    "raw fish (e.g. tuna, salmon)",
                    "wasabi",
                    "soy sauce",
                    "pickled ginger"
                ],
                "cooking_method": "1. Cook the sushi rice according to the package instructions.\n2. Cut the raw fish into thin slices.\n3. Shape the sushi rice into small oblong shapes.\n4. Top each rice ball with a slice of raw fish.\n5. Serve with wasabi, soy sauce, and pickled ginger.",
                "rating": 4.8
            }
        ]
    },
    {
        "id": "japanese_chef_006",
        "chef_picture": "https://images.unsplash.com/photo-1567879866251-a8dcd972b7ae?ixlib=rb-4.0.3&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1174&q=80",
        "chef_name": "Hirata Yamamoto",
        "years_of_experience": 10,
        "number_of_recipes": 65,
        "likes": 3000,
        "bio": "Hirata Yamamoto is a Japanese chef who specializes in Izakaya cuisine. He has worked in some of the top Izakaya restaurants in Tokyo and has developed a unique style of Izakaya cuisine that combines traditional Japanese flavors with a modern twist. Hirata is known for her creative  use of seasonal ingredients and her ability to create dishes that are both visually stunning and delicious. He is highly respected in the Japanese culinary community for her innovative approach to Izakaya cuisine.",
        "recipes": [
            {
                "id": "yakitori_001",
                "recipe_name": "Chicken Yakitori",
                "ingredients": [
                    "chicken thighs",
                    "green onions",
                    "soy sauce",
                    "mirin",
                    "sake",
                    "sugar",
                    "bamboo skewers"
                ],
                "cooking_method": "1. Cut the chicken thighs into small pieces.\n2. Cut the green onions into 2-inch pieces.\n3. Soak the bamboo skewers in water for 30 minutes.\n4. Thread the chicken and green onions onto the skewers.\n5. Mix together soy sauce, mirin, sake, and sugar to make a marinade.\n6. Brush the marinade onto the skewered chicken and green onions.\n7. Grill the skewers over medium-high heat until the chicken is cooked through and the green onions are slightly charred.\n8. Serve hot.",
                "rating": 4.7
            },
            {
                "id": "okonomiyaki_002",
                "recipe_name": "Okonomiyaki",
                "ingredients": [
                    "flour",
                    "eggs",
                    "cabbage",
                    "bonito flakes",
                    "green onions",
                    "mayonnaise",
                    "okonomiyaki sauce"
                ],
                "cooking_method": "1. Shred the cabbage into small pieces.\n2. In a bowl, whisk together flour, eggs, and water to make a batter.\n3. Mix the shredded cabbage into the batter.\n4. Heat a large skillet over medium heat.\n5. Pour the batter into the skillet to form a large pancake.\n6. Cook the pancake for several minutes on each side, until golden brown.\n7. Top the pancake with bonito flakes, green onions, mayonnaise, and okonomiyaki sauce.\n8. Serve hot.",
                "rating": 4.5
            },
            {
                "id": "ramen_003",
                "recipe_name": "Tonkotsu Ramen",
                "ingredients": [
                    "pork belly",
                    "garlic",
                    "onion",
                    "ginger",
                    "chicken broth",
                    "dried shiitake mushrooms",
                    "dried kelp",
                    "ramen noodles",
                    "green onions",
                    "bean sprouts",
                    "soft-boiled egg"
                ],
                "cooking_method": "1. Cut the pork belly into small pieces.\n2. In a large pot, sauté garlic, onion, and ginger until fragrant.\n3. Add the pork belly to the pot and cook until browned.\n4. Add chicken broth, dried shiitake mushrooms, and dried kelp to the pot.\n5. Simmer the broth for several hours, until rich and flavorful.\n6. Cook the ramen noodles according to the package instructions.\n7. Slice the green onions thinly.\n8. To serve, place the cooked ramen noodles in a bowl and pour the hot broth over the top.\n9. Top the ramen with sliced green onions, bean sprouts, and a soft-boiled egg.\n10. Serve hot.",
                "rating": 4.9
            }
        ]
    }
]